{"version":"v0.10.0","currentPage":12,"data":{"projectDetailsRespondent":"Logan Calkins","projectDetailsJob":"Analyst","projectDetailsDepartment-NS":"136","projectDetailsBranch":"Digital Services Branch","projectDetailsTitle":"Nachet: Artificial Intelligence for Weed Seed Identification","projectDetailsID":"NA","projectDetailsProgram":"Phytosanitary Certification & Weed Seeds Order","projectDetailsPhase":"item1","projectDetailsDescription":"Seed analysis and seed purity assessment, including weed species identification, soil and other pest detection, are critical activities conducted by the Canadian Food Inspection Agency (CFIA) which directly and indirectly support:\n\n•\tmarket access\n•\texport of Canadian agricultural goods\n•\tdomestic and international seed trade under the Seeds Act and\n•\tcompliance monitoring and surveillance for import and export under the Plant Protection Act including meeting the needs of phytosanitary agreements or measures.\n\nThere are two primary activities related to weed seed species identification:\n\n1.\tSeed Testing Under the Seeds Act: Testing and analysis of seeds for planting to support seed certification for domestic and international seed trade. The seeds for planting are at high risk to spread regulated weed seeds and other pests to the agricultural production base. \n2.\tWeed Seed Analysis to Support Import and Export Phytosanitary Certification: Testing and analysis to ensure that the import and export of agricultural commodities are compliant with the Plant Protection Act, Regulations, and policies, as well as acts & regulations of importing countries. \n\nOver the past number of years, resources within the Seed Science & Technology Section have been strained and staff are not often at full scope of testing. At the same time, the volume of Canadian grain exports continues to increase; Canada is continuously accessing new markets that require testing of samples which may contain new species of weed seeds. Although alternative service delivery (ASD) programs help for high volume export destinations, oversight and technical support to those ASD labs are likely to increase resource challenges.  Operations Branch employees that support weed seed analysis with limited scope also face resource constraints and need technical support.\n\nThe CFIA’s Seed Science & Technology Section (SSTS -Saskatoon) and Artificial Intelligence Lab (AI Lab – Montreal) have led a project to develop an AI tool, known as “Nachet”, which can accurately identify weed seeds of concern. This work was initially started as a research project to assess optimization opportunities of seed species identification and weed seed analysis by the Agency.","businessDrivers1":["item1","item2","item3","item5","item4"],"businessDrivers3":"As part of this project, a current state assessment was conducted through consultation with CFIA's Seed Science and Technology Section (SSTS - the client and co-lead for the project). During the assessment, the following needs were identified:\n\n1. Training support: An A.I tool which could be used during training to assist with increasing skills and proficiency in weed seed identification and address the following gaps:\no\tInspectors are required to complete a National Training Initiative and pass an exam, currently they do not complete ongoing training or monitoring regarding their proficiency in identifying regulated weed seeds. Note: this allows OPS to conduct a limited scope of testing for large seeded crops. Support with maintaining proficiency would be beneficial. \no\tSMEs within SSTS undergo 1500 hours of training to be able to identify 300 species with annual proficiency testing. With a wave of anticipated retirement of SMEs, limited training resources are available to new staff. Increasing efficiency in Weed Seed Identification would allow for more time to invest in training. A.I could also be used to help reduce the time required for training. \no\tAlternative Service Delivery laboratories under the REGAL program are required to develop their own training programs for the identification of weed seeds, SSTS currently conducts and oversees the annual weed seed proficiency testing for ASD laboratories. There is likely an interest amongst private third party laboratories to use A.I to support their training programs.\n\n2. Improving service standards for conducting weed seed analysis, leading to the decrease in turnaround time to be eligible to export Canadian Grains. \no\tDue to resource strains within SSTS, standards for time to conduct analysis were recently increased for grain export samples.\no\tAs exports of Canadian grain continue to increase, it is anticipated that resource strain will worsen as more exports will require testing.\n\n3. Improving CFIA's ability to adapt to new market needs, allowing industry to diversify trade relationships.\no\tWeed Seeds of concern can vary depending on the destination of the exported product, for this reason, CFIA analysts need to be able to quickly identify new species of regulated weed seeds as new international trade relationships are established. \n\n4. Increasing CFIA's capacity to conduct import surveillance.\no\tThere are concerns of weed seeds in imported agricultural products (e.g., grains and oilseeds, bird feed, seed, and hay) introducing regulated weed seeds into Canada’s environment and agricultural systems. This is likely due to resource strain within Operations Branch, where limited resources have led to fewer import inspections, with priority given to on-demand work (exports) over planned work.","businessDrivers4":"-Canadian grains & oilseeds exports contribute an extensive amount of value to the country's economy, with $35B in grains & oilseeds exported from Canada in 2023. Investing in the development and implementation of a tool which helps fast track the weed seed analysis work required for Canadian agricultural products to be exported to various countries would have positive effects on the economy. \n\n-Now more than ever, the ability to quickly adapt to new market needs, and diversify trade relationship where necessary is vital. An A.I tool which can efficiently support the identification of new weed seed species of interest would support this. \n\n-Weed infestations can cause high productivity losses for Canadian farmers and negative consequences to Canada's environment. Improving how regulated weed seed species are detected would contribute to mitigating the negative impact of weed infestations. ","businessDrivers5":"item3-0","businessDrivers6":"Based on a small trial, the Nachet AI tool demonstrated a reduction in weed seed analysis time to a fraction (i.e., reducing the 1 hour (PHE clean sample) spent by an analyst to 20 mins for a 1kg wheat sample).   The sample number of Plant Health Export (PHE), Plant Health Import (PHI) and International Seed Testing Association (ISTA) seed samples are included in the table below (Table 1). Provided investment into the development of Nachet continues, this not only potentially saves time, but more importantly addresses the current shortage of experts. \n\nTable 1.  Distribution of Test Types and Estimated Time Gained with AI at > 90 % Accuracy (i.e., full implementation)\n\tTest type\tPercent of test type vs total test type\tPotential percent of time gained when AI is at 99%*\nWeed Seed ID time reduction for samples that take 1 hour \tPHE, PHI, ISTA Seed samples (large seeded crops)\t93.76%\t50.00% / 30 mins\nWeed Seed ID time reduction for samples that take 5 hours \tISTA Seed samples (small seeded crops)\t5.98%\t90.00% / 4.5 hours\nWeed Seed ID time reduction for samples that take 4 hours \tPHE pellets (feeds)\t0.26%\t87.50% / 3.5 hours\n*Assuming AI takes 30 min for ALL samples. Given that the AI model will never be entirely trained due to the continuous emergence of new import requirements, emergence of new weed seeds, this figure is estimated at 99%. AI is currently able to identify 27 weed seed species of the 300 an analyst can identify.\n\nTable 2.  Potential Future Benefit of AI on Weed Seed Identification: Resource Reinvestment\nTest type\tPeak annual sample volume*\tWeed seed ID time with no AI tool (hours)**\tWeed seed ID time with AI tool (hours)**\tPotential FTE reinvestment when using AI in weed seed ID***\tPotential cost reinvestment when using AI in weed seed ID****\nPHE, PHI, ISTA Seed samples (large seeded crops)\t2884\t2884\t1442\t1.18\t$135,585.32\nISTA Seed samples (small seeded crops)\t184\t920\t92\t0.68\t$77,853.43\nPHE pellets (feeds)\t8\t32\t4\t0.02\t$2,632.72\nTotal\t3076\t3836\t1538\t1.89\t$216,071.47\n*Peak annual sample volume represents the highest number of samples processed in a single fiscal year from FY 2021/2022 to 2024/2025. The sample number includes COGNOS data for ALL samples sent to SSTS for weed seed analysis. \n**Assuming AI takes 30 min for ALL samples and the weed seed identifications times based on Table 1. Given that the AI model will never be entirely trained due to the continuous emergence of new import requirements, emergence of new weed seeds, this figure is estimated at 99%. AI is currently able to identify 27 weed seed species of the 300 an analyst can identify. \n***Laboratory FTEs were calculated based on 1218 hours (e.g., direct cost) to account for annual leave, training and administration time.\n****FTE cost is the top step for an EG- 4 (Step 7: $90176; January 1, 2025) multiplied by 1.27 to account for the enhanced benefits package (EBP). Analyses are completed by both EG-3 and EG-4 however, most are at the EG-4 level.\t\t\n\nIn addition to increasing capacity to conduct weed seed analysis activities, it is anticipated that the AI tool would decrease the amount of time currently required (1500 hours per analyst) for SSTS analysts to be able to identify 300 weed seeds. \n\nCurrently, the laboratory has 13 analysts who perform weed seed analyses as a portion of their responsibilities, but only 8 are fully trained with 300 species. In the next 1 to 5 years, 6 analysts are expected to retire, leaving only 2 fully trained employees. Once the AI model is fully trained and implemented, it has the potential to fill the gap and allow resources to train new staff. This capacity gained will allow SSTS to deliver critical tasks such as:\n•\tTraining new staff of next generation of seed analysts\n•\tAI tool training, maintenance, and calibration \n•\tMaintenance and enhancement of reference collection of the National Seed Herbarium\n•\tDevelopment of national training materials for seed and grain testing ASD labs\n•\tTest method development (standardization and technology)\n•\tOversight and maintenance of Alternative Service Delivery programs\n•\tProficiency testing\n•\tResearch & innovation on full sample auto analysis on physical purity and seed germination\n•\tQuality assurance and control tasks (e.g., internal audits)\n•\tIncrease capacity in analyses (e.g., import monitoring on Canadian regulation compliance, provide survey data for market access, germination, and purity analysis)\n•\tEquipment maintenance\n\nThis reallocation will ensure continued efficiency, maintain testing capacity, and provide adequate resources for other vital tasks completed by SSTS.","businessDrivers7":"The tool has been trained on seed images of plant species that have been selected from 120 years of reference seed collections representing more than 20,000 specimens. This collection is one of the largest collections the world, and is housed at SSTS. Canada is leading the push to use this cutting-edge technology in seed identification. In addition, through consultations with SSTS, the International Seed Testing Association (ISTA) is moving towards accepting AI results for issuance of a Seed Testing Certificate. \n\nFrom a development standpoint - CFIA is following an open source approach - with the transparent publication of code on GitHub. Rigorous testing is also being conducted to ensure that the tool is accurate.","businessDrivers8":"For this project, accuracy of weed seed identification is of utmost importance as it is extremely vital that Canadian shipments of grains and oilseeds do not contain regulated weed seeds which would be detected by the importing country and lead to negative impacts on Canada's ability to trade with the country. At the same time, time required to conduct the weed seed analysis work should aim to be as efficient as possible in order to quickly respond to industry requests for phytosanitary certificates required to export their product. ","businessDrivers9":"item1-0","businessDrivers10":"Yes, to address the surge in Canadian grain exports in 2015 and high resource strain across laboratory analysts working in SSTS, A national training initiative and operational procedure was established to allow CFIA inspectors in Operations Branch to conduct weed seed inspection for large-seeded grain crop kinds including soybeans, peas, lentils, chickpeas, beans, faba beans or corn. The procedures are specific to grain samples representing grain export shipments (non-propagative end uses). All other crop kinds and propagative material must be analyzed for weed seeds by SSTS or CFIA-authorized laboratories under the Recognition of Export Grain Analysis by authorized Laboratories (REGAL) Program. Although this helps with basic weed seed identification, there are some concerns that operational resources are now strained. In addition, high volumes of grain exports, employee turnaround, and resource strain in SSTS has made it difficult to maintain skills and proficiency amongst operations branch inspectors. Automation would support both SSTS and Inspectors in Operations by increasing CFIA's efficiency and ability to respond to high volume demands amongst industry. ","businessDrivers11":["item2-2","item3-0","item4-0","item5-0"],"riskProfile1":"item2-0","riskProfile2":"item2-0","riskProfile3":"item2-0","riskProfile4":"item2-0","riskProfile5":"item2-0","projectAuthority1":"item2-0","aboutSystem1":["item1"],"aboutAlgorithm1":"item2-0","aboutAlgorithm2":"item2-0","decisionSector3":"Depending on the implementation strategy, the final product would automate the flagging of potential weed seeds of concern, supporting analysts working at the CFIA and industry exporters of Canadian seeds and grain. ","decisionSector1":["item5-1"],"impact30":"item2-2","impact31":"The A.I tool is paired with a digital microscope. CFIA employees take a sample of seeds and/or grains, take an image of them, upload the image to the tool, and the tool flags potential regulated weed seed species for review.","impact3":"item2-0","impact20":"The tool acts as a stand alone - there is no personal client data collected, all that is uploaded to the tool is an image of a sample of seeds and/or grains. The only judgement made will be entirely objective - focusing on whether or not a regulated weed seed is present in the image. ","impact21":"The output of the tool is an interface/dashboard which presents an image of the sample of seeds. Within the image, the tool adds a circle to various seeds and indicates the percentage of confidence and the species that the circle is showing. ","impact22":"item2-0","impact5":"item2-0","impact6":"item3-3","impact7":"item1-1","impact8":"if a regulated weed seed is detected and confirmed by a CFIA employee, the industry member is notified immediately. The shipment may then be detained or quarantined, and is prevented from leaving the country. Remedial measures must then be taken by the exporter, which may include re-cleaning or reconditioning the grain. If the contamination is beyond acceptable limits and cannot be remedied with available cleaning or treatment methods, the CFIA could refuse to issue the necessary export certification.","impact9":"item1-1","impact10":"This project does not have any impacts on the rights and freedoms of individuals. ","impact24":"item1-1","impact25":"There is no personal information collected which poses a risk to impacting the equality, dignity, privacy or autonomy of individuals. ","impact11":"item1-1","impact12":"No impact on the health or well-being of individuals","impact13":"item2-2","impact14":"Should a regulated weed seed be detected, depending on the importing country, there is a possibility that the shipment may not be permissible for export, however, these regulatory enforcement decisions would be finalized by a CFIA representative, and not automated by the tool. In addition, regulatory enforcement decisions on one shipment protect the broader market access for all of industry, as one contaminated shipment found by an importing country can risk the closure of trade relationships. ","impact15":"item2-2","impact16":"Efficiently detecting regulated weed seeds in imports and exports would benefit the environment, reducing the risk of harmful weed infestation which can affect crop outputs and public land. ","aboutDataSource1":"item2-0","aboutDataSource2":"item1-0","aboutDataSource3":"item1-0","aboutDataSource4":"item2-0","aboutDataSource5":"item1-4","aboutDataSource6":"item2-0","aboutDataSource7":"item1-1","aboutDataSource8":"item1-1","aboutDataSource13":"The tool has been trained on seed images of plant species that have been selected from 120 years of reference seed collections representing more than 20,000 specimens. This collection is one of the largest collections the world, and is housed at the CFIA's Seed Science and Technology Laboratory. Analysts working for CFIA take high resolution zoomed in images of each seed of interest and upload multiples of them into the tool to train the system. ","aboutDataType1":"item2","consultationDesign1":"item1-1","consultationDesign2":["item4","item5","item6","item7"],"consultationDesign3":"item1-1","consultationDesign4":["item7","item8","item14"],"dataQualityDesign1":"item1-2","dataQualityDesign2":"item1-1","dataQualityDesign3":"item1-1","dataQualityDesign4":"item1-1","dataQualityDesign5":"item2-0","dataQualityDesign6":"item2-0","dataQualityDesign7":"item1-2","dataQualityDesign8":"item1-2","dataQualityDesign9":"item1-1","dataQualityDesign10":"item1-2","fairnessDesign1":"item1-1","fairnessDesign2":"item1-2","fairnessDesign3":"item1-2","fairnessDesign4":"item1-1","fairnessDesign5":"item1-2","fairnessDesign6":"item1-1","fairnessDesign7":"item1-1","fairnessDesign8":"item1-2","fairnessDesign9":"item1-1","fairnessDesign10":"item1-2","fairnessDesign11":"item1-1","fairnessDesign12":"item1-1","fairnessDesign13":"item1-2","fairnessDesign14":"item1-2","fairnessDesign15":"item1-1","fairnessDesign16":"item1-2","fairnessDesign17":"item1-1","privacyDesign1":"item1-1","privacyDesign5":"The concept case / prototype is currently undergoing a Privacy Impact Assessment as part of a larger CFIA project assessing privacy related considerations on various digital tools under development","privacyDesign2":"item1-1","privacyDesign3":"item2-0","privacyDesign4":"item1-1","privacyDesign7":"item1-1","privacyDesign8":"no personal information is collected"},"translationsOnResult":{}}